{
  "posts": [
    {
      "id": 1,
      "title": "Trending technologies for frontend web development",
      "category": "Reviews",
      "date": "2024-07-09",
      "author": "Abdessamad",
      "thumbnail": "assets/img/5.svg",
      "excerpt": "Exploring the latest technologies and frameworks that are shaping the future of frontend development.",
      "content": {
        "type": "html",
        "body": "<p>Frontend web development is evolving rapidly, with new frameworks and tools emerging constantly. In this post, we'll explore some of the most trending technologies that are making waves in 2024.</p><h2>React and Next.js</h2><p>React continues to dominate the frontend landscape, with Next.js providing an excellent framework for server-side rendering and static site generation.</p><h2>Vue.js 3</h2><p>Vue.js 3 brings improved performance and a better developer experience with the Composition API.</p><h2>TypeScript</h2><p>TypeScript adoption continues to grow as developers seek better type safety and tooling support.</p>"
      },
      "galleries": [],
      "videos": []
    },
    {
      "id": 2,
      "title": "Advice for young engineers and mistakes you can avoid",
      "category": "Journey",
      "date": "2024-10-09",
      "author": "Abdessamad",
      "thumbnail": "assets/img/5.svg",
      "excerpt": "Lessons learned from my journey as a software engineer and common pitfalls to avoid.",
      "content": {
        "type": "html",
        "body": "<p>Starting a career in software engineering can be overwhelming. Here are some key lessons I've learned along the way.</p><h2>Don't Try to Learn Everything</h2><p>Focus on mastering one technology stack before jumping to the next shiny framework.</p><h2>Build Projects, Not Just Tutorials</h2><p>Real-world projects teach you problem-solving skills that tutorials can't.</p><h2>Code Reviews Are Your Friend</h2><p>Embrace feedback and use code reviews as learning opportunities.</p>"
      },
      "galleries": [],
      "videos": []
    },
    {
      "id": 3,
      "title": "Easy and intuitive git commands you must know!",
      "category": "Tutorials",
      "date": "2024-08-09",
      "author": "Abdessamad",
      "thumbnail": "assets/img/5.svg",
      "excerpt": "Essential Git commands that every developer should master for efficient version control.",
      "content": {
        "type": "html",
        "body": "<p>Git is an essential tool for every developer. Here are the most important commands you need to know.</p><h2>Basic Commands</h2><pre><code>git clone [url]\ngit status\ngit add .\ngit commit -m 'message'\ngit push</code></pre><h2>Branching</h2><pre><code>git branch\ngit checkout -b [branch-name]\ngit merge [branch-name]</code></pre><h2>Useful Tips</h2><p>Always check your status before committing, and write clear commit messages!</p>"
      },
      "galleries": [],
      "videos": []
    }
  ]
}

